SOS2011/Documents/Background/omExample_InsertObservationRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope
	xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" 
	xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sos.xsd http://www.opengis.net/samplingSpatial/2.0 http://schemas.opengis.net/samplingSpatial/2.0/spatialSamplingFeature.xsd" 
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
	xmlns:wsa="http://www.w3.org/2005/08/addressing" 
	xmlns:swe="http://www.opengis.net/swe/2.0" 
	xmlns:swes="http://www.opengis.net/swes/2.0" 
	xmlns:ows="http://www.opengis.net/ows/1.1" 
	xmlns:sams="http://www.opengis.net/samplingSpatial/2.0"
	xmlns:sf="http://www.opengis.net/sampling/2.0"
	xmlns:sos="http://www.opengis.net/sos/2.0" 
	xmlns:fes="http://www.opengis.net/fes/2.0" 
	xmlns:gml="http://www.opengis.net/gml/3.2" 
	xmlns:ogc="http://www.opengis.net/ogc" 
	xmlns:om="http://www.opengis.net/om/2.0" 
	xmlns:xlink="http://www.w3.org/1999/xlink">
	<soap12:Header>
		<wsa:To>http://my.client.com/client/myReceiver</wsa:To>
		<wsa:Action>http://www.opengis.net/sos/2.0/GetObservationResponse</wsa:Action>
		<wsa:RelatesTo>http://my.client.com/uid/msg-0010</wsa:RelatesTo>
	</soap12:Header>
	<soap12:Body>
		<sos:InsertObservation service="SOS" version="2.0.0">
			
			<sos:offering>some_SOS_offering</sos:offering>
			
			<sos:observation>
				<om:OM_Observation gml:id="obsTest1">
				  
				  <!-- defining the type of observation facilitates parsing: -->
				  <om:type xlink:href="http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_SWEObservation"/>

				<!-- time period for which this O&M document contains observations - temporal extent -->				
				<om:phenomenonTime >
					<gml:TimePeriod gml:id="phenomenonTime1">
						<gml:beginPosition>2010-06-02T00:00:00.000+2:00</gml:beginPosition>
						<gml:endPosition>2010-06-02T09:00:00.000+2:00</gml:endPosition>
					</gml:TimePeriod>
				</om:phenomenonTime>
				
				<om:resultTime xlink:href="#phenomenonTime1"/>
			
				  <!-- identifiers of the sensors that have created the observations contained in this document -->
				  <om:procedure xlink:href="urn:x-eea:object:sensor:noise:IE10001"/> <!-- a URL would be better -->
				  
				  <!-- description of the observed phenomenon -->
				  <om:observedProperty xlink:href="http://sweet.jpl.nasa.gov/2.0/physSound.owl#Noise"/>
			
				  <!-- description of the station feature where the observations were measured -->
				  <om:featureOfInterest>
					  
					  <sams:SF_SpatialSamplingFeature gml:id="smithfield_gmlid">
					  <!-- are both, identifier and name, desired? -->
					  <gml:identifier codeSpace="http://www.eea.europa.eu">Smithfield</gml:identifier><!-- or can we put a more concrete codespace? -->
					  <gml:name>Smithfield</gml:name>
					  
					  <sf:type xlink:href="http://www.opengis.net/def/samplingFeatureType/OGC-OM/2.0/SF_SamplingPoint"/>

					  <!-- here we could point to a 'bigger' feature -->
					  <sf:sampledFeature xsi:nil="true" />
					  
					  <sams:shape>
						<gml:Point gml:id="p1">
						  <gml:pos srsName="http://www.opengis.net/def/crs/EPSG/0/4326">53.348809 -6.270446</gml:pos>
						</gml:Point>
					  </sams:shape>
					</sams:SF_SpatialSamplingFeature>
				  </om:featureOfInterest>
			   
				  <!-- the observation data are encoding into a compact form -->
				  <om:result xsi:type="swe:DataArrayPropertyType">
					<swe:DataArray>
					  <swe:elementCount>
						<swe:Count>
						  <swe:value>9</swe:value>
						</swe:Count>
					  </swe:elementCount>
					  <swe:elementType name="Components">
						<swe:DataRecord>
						  <swe:field name="SamplingTime">
							<swe:Time definition="http://www.opengis.net/def/property/OGC/0/SamplingTime">
							  <swe:uom xlink:href="http://www.opengis.net/def/uom/ISO-8601/0/Gregorian"/>
							</swe:Time>
						  </swe:field>
						  <swe:field name="feature">
							<swe:Text definition="http://www.opengis.net/def/property/OGC/0/FeatureOfInterest"/>
						  </swe:field>
						  <swe:field name="noise">
							<swe:Quantity definition="http://sweet.jpl.nasa.gov/2.0/physSound.owl#Noise">
							  <swe:uom code="dB"/>
							</swe:Quantity>               
						  </swe:field>              
						</swe:DataRecord>                       
					  </swe:elementType>
					  
					  <swe:encoding>
						<swe:TextEncoding decimalSeparator="." tokenSeparator="," blockSeparator=";"/>  
					  </swe:encoding>
			
					  <swe:values>
						2010-06-02T00:00:00.000+2:00/2010-06-02T01:00:00.000+2:00,Smithfield,43.0;
						2010-06-02T01:00:00.000+2:00/2010-06-02T02:00:00.000+2:00,Smithfield,40.0;
						2010-06-02T02:00:00.000+2:00/2010-06-02T03:00:00.000+2:00,Smithfield,38.0;
						2010-06-02T03:00:00.000+2:00/2010-06-02T04:00:00.000+2:00,Smithfield,41.0;
						2010-06-02T04:00:00.000+2:00/2010-06-02T05:00:00.000+2:00,Smithfield,44.0;
						2010-06-02T05:00:00.000+2:00/2010-06-02T06:00:00.000+2:00,Smithfield,48.0;
						2010-06-02T06:00:00.000+2:00/2010-06-02T07:00:00.000+2:00,Smithfield,50.0;
						2010-06-02T07:00:00.000+2:00/2010-06-02T08:00:00.000+2:00,Smithfield,52.0;
						2010-06-02T08:00:00.000+2:00/2010-06-02T09:00:00.000+2:00,Smithfield,55.0;
					  </swe:values>
					  
					</swe:DataArray>          
				  </om:result>      
				</om:OM_Observation>
			</sos:observation>
			
			
			
			<sos:observation>
				<om:OM_Observation gml:id="obsTest2">
				  
				  <!-- defining the type of observation facilitates parsing: -->
				  <om:type xlink:href="http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_SWEObservation"/>
				  
					<!-- time period for which this O&M document contains observations - temporal extent -->
					<om:phenomenonTime >
						<gml:TimePeriod gml:id="phenomenonTime2">
							<gml:beginPosition>2010-06-02T00:00:00.000+2:00</gml:beginPosition>
							<gml:endPosition>2010-06-02T09:00:00.000+2:00</gml:endPosition>
						</gml:TimePeriod>
					</om:phenomenonTime>
			
				  <om:resultTime xlink:href="#phenomenonTime2"/>
			
				  <!-- identifiers of the sensors that have created the observations contained in this document -->
				  <om:procedure xlink:href="urn:x-eea:object:sensor:noise:IE10002"/> <!-- a URL would be better -->
				  
				  <!-- description of the observed phenomenon -->
				  <om:observedProperty xlink:href="http://sweet.jpl.nasa.gov/2.0/physSound.owl#Noise"/>
					  
					  <!-- description of the station feature where the observations were measured -->
				  <om:featureOfInterest>
					  
					  <sams:SF_SpatialSamplingFeature gml:id="bridgeStreet_gmlid">
					  <!-- are both, identifier and name, desired? -->
					  <gml:identifier codeSpace="http://www.eea.europa.eu">BridgeStreet</gml:identifier><!-- or can we put a more concrete codespace? -->
					  <gml:name>Bridge Street</gml:name>
					  
					  <sf:type xlink:href="http://www.opengis.net/def/samplingFeatureType/OGC-OM/2.0/SF_SamplingPoint"/>

					  <!-- here we could point to a 'bigger' feature -->
					  <sf:sampledFeature xsi:nil="true" />
					  
					  <sams:shape>
						<gml:Point gml:id="p2">
						  <gml:pos srsName="http://www.opengis.net/def/crs/EPSG/0/4326">53.341494 -6.228990</gml:pos>
						</gml:Point>
					  </sams:shape>
					</sams:SF_SpatialSamplingFeature>
				  </om:featureOfInterest>
			
				  <!-- the observation data are encoding into a compact form -->
				  <om:result xsi:type="swe:DataArrayPropertyType">
					<swe:DataArray>
					  <swe:elementCount>
						<swe:Count>
						  <swe:value>9</swe:value>
						</swe:Count>
					  </swe:elementCount>
					  <swe:elementType name="Components">
						<swe:DataRecord>
						  <swe:field name="SamplingTime">
							<swe:Time definition="http://www.opengis.net/def/property/OGC/0/SamplingTime">
							  <swe:uom xlink:href="http://www.opengis.net/def/uom/ISO-8601/0/Gregorian"/>
							</swe:Time>
						  </swe:field>
						  <swe:field name="feature">
							<swe:Text definition="http://www.opengis.net/def/property/OGC/0/FeatureOfInterest"/>
						  </swe:field>
						  <swe:field name="noise">
							<swe:Quantity definition="http://sweet.jpl.nasa.gov/2.0/physSound.owl#Noise">
							  <swe:uom code="dB"/>
							</swe:Quantity>               
						  </swe:field>              
						</swe:DataRecord>                       
					  </swe:elementType>
			
					  <swe:encoding>
						<swe:TextEncoding decimalSeparator="." tokenSeparator="," blockSeparator=";"/>
					  </swe:encoding>
			
					  <swe:values>
						2010-06-02T00:00:00.000+2:00/2010-06-02T01:00:00.000+2:00,BridgeStreet,53.0;
						2010-06-02T01:00:00.000+2:00/2010-06-02T02:00:00.000+2:00,BridgeStreet,50.0;
						2010-06-02T02:00:00.000+2:00/2010-06-02T03:00:00.000+2:00,BridgeStreet,58.0;
						2010-06-02T03:00:00.000+2:00/2010-06-02T04:00:00.000+2:00,BridgeStreet,51.0;
						2010-06-02T04:00:00.000+2:00/2010-06-02T05:00:00.000+2:00,BridgeStreet,54.0;
						2010-06-02T05:00:00.000+2:00/2010-06-02T06:00:00.000+2:00,BridgeStreet,58.0;
						2010-06-02T06:00:00.000+2:00/2010-06-02T07:00:00.000+2:00,BridgeStreet,60.0;
						2010-06-02T07:00:00.000+2:00/2010-06-02T08:00:00.000+2:00,BridgeStreet,62.0;
						2010-06-02T08:00:00.000+2:00/2010-06-02T09:00:00.000+2:00,BridgeStreet,65.0;
					  </swe:values>
			
					</swe:DataArray>
				  </om:result>
				</om:OM_Observation>
			</sos:observation>
			
			
		</sos:InsertObservation>
	</soap12:Body>
</soap12:Envelope>